In [1]:
import numpy as np
import pandas as pd

In [3]:
import pandas as pd

data = {
    'Region': ['North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Salesperson': ['Amit', 'Neha', 'Ravi', 'Pooja', 'Amit', 'Ravi', 'Neha', 'Amit', 'Pooja', 'Neha'],
    'Product': ['Laptop', 'Mobile', 'Tablet', 'Laptop', 'Mobile', 'Tablet', 'Laptop', 'Tablet', 'Mobile', 'Laptop'],
    'Month': ['Jan', 'Jan', 'Feb', 'Feb', 'Mar', 'Mar', 'Mar', 'Apr', 'Apr', 'Apr'],
    'Sales': [20000, 15000, 22000, 18000, 25000, 17000, 21000, 24000, 26000, 19000]
}

df = pd.DataFrame(data)

In [4]:
df

  Region Salesperson Product Month  Sales
0  North        Amit  Laptop   Jan  20000
1  South        Neha  Mobile   Jan  15000
2   East        Ravi  Tablet   Feb  22000
3   West       Pooja  Laptop   Feb  18000
4  North        Amit  Mobile   Mar  25000
5  South        Ravi  Tablet   Mar  17000
6   East        Neha  Laptop   Mar  21000
7   West        Amit  Tablet   Apr  24000
8  North       Pooja  Mobile   Apr  26000
9  South        Neha  Laptop   Apr  19000

In [9]:
d = pd.pivot_table(df,values= 'Sales',index='Region',columns='Product',aggfunc='median')

In [10]:
d

Product   Laptop   Mobile   Tablet
Region
East     21000.0      NaN  22000.0
North    20000.0  25500.0      NaN
South    19000.0  15000.0  17000.0
West     18000.0      NaN  24000.0

In [22]:
df['Discount'] = [10,15,8,9,10,12,13,15,20,16]

In [23]:
df

  Region Salesperson Product Month  Sales  Discount
0  North        Amit  Laptop   Jan  20000        10
1  South        Neha  Mobile   Jan  15000        15
2   East        Ravi  Tablet   Feb  22000         8
3   West       Pooja  Laptop   Feb  18000         9
4  North        Amit  Mobile   Mar  25000        10
5  South        Ravi  Tablet   Mar  17000        12
6   East        Neha  Laptop   Mar  21000        13
7   West        Amit  Tablet   Apr  24000        15
8  North       Pooja  Mobile   Apr  26000        20
9  South        Neha  Laptop   Apr  19000        16

In [21]:
pd.pivot_table(df,values='Discount',index='Salesperson',columns='Product')

Product      Laptop  Mobile  Tablet
Salesperson
Amit          900.0   456.0   786.0
Neha          515.5   566.0     NaN
Pooja         789.0   454.0     NaN
Ravi            NaN     NaN   400.5

In [26]:
df['Net Sales'] = df['Sales'] - (df['Sales'] * df['Discount'] / 100)

In [27]:
df

  Region Salesperson Product Month  Sales  Discount  Net Sales
0  North        Amit  Laptop   Jan  20000        10    18000.0
1  South        Neha  Mobile   Jan  15000        15    12750.0
2   East        Ravi  Tablet   Feb  22000         8    20240.0
3   West       Pooja  Laptop   Feb  18000         9    16380.0
4  North        Amit  Mobile   Mar  25000        10    22500.0
5  South        Ravi  Tablet   Mar  17000        12    14960.0
6   East        Neha  Laptop   Mar  21000        13    18270.0
7   West        Amit  Tablet   Apr  24000        15    20400.0
8  North       Pooja  Mobile   Apr  26000        20    20800.0
9  South        Neha  Laptop   Apr  19000        16    15960.0